/* If a bar code scanner has no name and no product name, this is used as the bar code scanner's display name. */
"BarcodeScannerDefaultName" = "Bar code Scanner";

/* Detail text for bluetooth bar code scanners. */
"BluetoothBarcodeScannerDetailText" = "Connected via Bluetooth";

/* The manufacturer name for Bluetooth LE connected card readers made by Square. */
"BluetoothLECardReaderLifecycleManagerManufacturerNameSquare-BLE" = "Square";

/* The manufacturer name for USB connected card readers made by Square. */
"BluetoothLECardReaderLifecycleManagerManufacturerNameSquare-USB" = "Square";

/* The model name for the Square Reader for contactless and chip (codename R12) when connected wirelessly. */
"BluetoothLECardReaderLifecycleManagerModelNameR12-BLE" = "Contactless and Chip";

/* The model name for the Square Reader for contactless and chip (codename R12) when connected over USB. Should be the same name as when it is connected over wirelessly. */
"BluetoothLECardReaderLifecycleManagerModelNameR12-USB" = "Contactless and Chip";

/* The description of the error message displayed when a bluetooth LE peripheral failed to pair with Point of Sale. */
"BluetoothLEPeripheralGenericPairingErrorDescription" = "Point of Sale failed to pair with your Square Reader for contactless and chip. Please try pairing again.";

/* The title of the error message displayed when a bluetooth LE peripheral failed to pair with Point of Sale. */
"BluetoothLEPeripheralGenericPairingErrorTitle" = "Failed to Pair";

/* If a Bluetooth printer has no name and no product name, this is used as the printer's display name. */
"BluetoothPrinterDefaultName" = "BT Printer";

/* Placeholder default name for a paired Bluetooth printer. */
"BluetoothPrinterPlaceholderName" = "BT Printer %@";

/* If a card reader has no name and no product name, this is used as the card reader's display name. */
"CardReaderDefaultName" = "Card Reader";

/* Title of the initialization state arrived at once the reader is preparing to accept payments. This includes, among other things, establishing a secure session. */
"CardReaderInitializationStateTitleConnecting" = "Connecting";

/* Title of the initialization state arrived at once the reader was not able to successfully initialize. */
"CardReaderInitializationStateTitleFailed" = "Failed";

/* Title of the initialization state arrived at once the reader is ready to take payments. */
"CardReaderInitializationStateTitleReady" = "Ready";

/* Title of the initialization state arrived at once the reader is ready to take payments, however, connectivity guidance has detected multiple issues with the reader. The number of issues detected will be substituted into the '%@' field. */
"CardReaderInitializationStateTitleReadyWithMultipleIssues" = "Ready (%1$@ issues)";

/* Title of the initialization state arrived at once the reader is ready to take payments, however, connectivity guidance has detected an issue with the reader. */
"CardReaderInitializationStateTitleReadyWithOneIssue" = "Ready (1 issue)";

/* Title of the initialization state wherein the reader is paired with Point of Sale but not connected. A connection will automatically be established when the reader enters range. Applies only to wireless peripherals. */
"CardReaderInitializationStateTitleUnavailable" = "Unavailable";

/* Title of the default initialization state. This is not a state which should be displayed in normal circumstances. */
"CardReaderInitializationStateTitleUnknown" = "Unknown";

/* Title of the initialization state arrived at once the reader is updating its firmware. */
"CardReaderInitializationStateTitleUpdating" = "Updating";

/* In Point of Sale, Miura card readers should be identified as Miura nnn where 'nnn' is the last 3 digits of the serial number. The first format parameter is the last 3 digits of the serial number. */
"CardReaderMuiraPlaceholderNameFormatString" = "Miura %@";

/* Format for showing the card reader name (first parameter) and the last 4 digits of the serial number (second parameter). */
"CardReaderNameAndSerialNumberFormat" = "%1$@ (%2$@)";

/* If a cash drawer has no name and no product name, this is used as the cash drawer's display name. */
"CashDrawerDefaultName" = "Cash Drawer";

/* The error message shown when a card reader needs Point of Sale to be updated before it can connect */
"HQBluetoothLECardReaderPairingAppUpdateRequiredMessage" = "Please update Square Point of Sale to use the Square Reader for contactless and chip.";

/* The error title shown when a card reader needs Point of Sale to be updated before it can connect. */
"HQBluetoothLECardReaderPairingAppUpdateRequiredTitle" = "Square Point of Sale Update Required";

/* The title of the affordance that will allow the merchant to upgrade Point of Sale. */
"HQBluetoothLECardReaderPairingAppUpdateRequiredUpgradeTitle" = "App Store";

/* The name of Square Point of Sale. This name appears in the dialog shown when the merchant attempts to pair an R12 and Bluetooth is off, which will instruct them to turn Bluetooth on. */
"HQBluetoothLECardReaderPairingDeviceBluetoothTurnedOffAlert-PointOfSaleAppName" = "Point of Sale";

/* The title of the alert shown when attempting to pair with a Contactless and Chip card reader over Bluetooth LE (codename R12) and Bluetooth is turned off on the iOS device. The format specifier will be replaced by the name of the Square app the merchant is using - e.g. 'Point of Sale'. */
"HQBluetoothLECardReaderPairingDeviceBluetoothTurnedOffAlertTitle" = "Turn On Bluetooth to Allow \"%1$@\" to Connect to Accessories";

/* The message of the alert shown when attempting to pair with a Contactless and Chip card reader over Bluetooth LE (codename R12) and the iPad Square Point of Sale is running on does not support Bluetooth LE. */
"HQBluetoothLECardReaderPairingDeviceNotSupportedAlertMessage~pad" = "This iPad does not support connecting the Square Reader for contactless and chip wirelessly. Please plug your reader in via USB with a Square Stand.";

/* The message of the alert shown when attempting to pair with a Contactless and Chip card reader over Bluetooth LE (codename R12) and the iPhone Square Point of Sale is running on does not support Bluetooth LE. */
"HQBluetoothLECardReaderPairingDeviceNotSupportedAlertMessage~phone" = "This device is not compatible with the Square Reader for contactless and chip.";

/* The title of the alert shown when attempting to pair with a Contactless and Chip card reader over Bluetooth LE (codename R12) and the iPad Square Point of Sale is running on does not support Bluetooth LE. */
"HQBluetoothLECardReaderPairingDeviceNotSupportedAlertTitle~pad" = "Wireless Not Supported";

/* The title of the alert shown when attempting to pair with a Contactless and Chip card reader over Bluetooth LE (codename R12) and the iPhone Square Point of Sale is running on does not support Bluetooth LE. */
"HQBluetoothLECardReaderPairingDeviceNotSupportedAlertTitle~phone" = "Device Not Supported";

/* The button on the alert shown when attempting to pair with a Contactless and Chip card reader over Bluetooth LE (codename R12) and the device Square Point of Sale is running on does not support Bluetooth LE. When this button is tapped, the merchant will be taken to a page on Square's website showing them a list of all compatible devices. */
"HQBluetoothLECardReaderPairingDeviceNotSupportedViewCompatibleDevicesButtonTitle" = "View Compatible Devices";

/* The message contents of the alert shown when attempting to pair with a Contactless and Chip card reader over Bluetooth LE (codename R12) and iOS experiences a Bluetooth LE error, requiring pairing to be restarted. */
"HQBluetoothLECardReaderPairingUnexpectedErrorAlertMessage" = "Please try pairing again. If this issue persists, please contact Square Support.";

/* The title of the alert shown when attempting to pair with a Contactless and Chip card reader over Bluetooth LE (codename R12) and iOS experiences a Bluetooth LE error, requiring pairing to be restarted. */
"HQBluetoothLECardReaderPairingUnexpectedErrorAlertTitle" = "A Bluetooth Error Occurred";

/* Display name for peripheral with no custom name, placeholder name, or manufacturer/model name. */
"HQPeripheralDefaultDisplayName" = "Peripheral";

/* The text on the 'dismiss' button when an alert regarding a new card reader connectivity issue is shown. */
"HQReaderConnectivityGuidanceAlertViewDismissButton" = "Dismiss";

/* The message in the UI Alert view that is displayed when a reader connectivity issue is detected due to bluetooth disconnections. */
"HQReaderConnectivityGuidanceAlertViewMessageBLEConnectionDrops" = "Frequent bluetooth disconnections have been detected between your Card Reader and your device.";

/* The message in the UI Alert view that is displayed when a reader connectivity issue is detected due to EMI interference. */
"HQReaderConnectivityGuidanceAlertViewMessageEMIInterference" = "Frequent reader disconnections have been detected between your Square Reader for contactless and chip and your device.";

/* The message in the UI Alert view that is displayed when a reader connectivity issue regarding a flaky USB cable is detected. */
"HQReaderConnectivityGuidanceAlertViewMessageFlakyCable" = "The cables connecting your device to your power outlet have been repeatedly dropping connection.";

/* The title of the UI Alert view that is displayed when a reader connectivity issue is detected due to bluetooth disconnections. */
"HQReaderConnectivityGuidanceAlertViewTitleBLEConnectionDrops" = "Frequent Bluetooth Disconnections";

/* The title of the UI Alert view that is displayed when a reader connectivity issue is detected due to EMI interference. */
"HQReaderConnectivityGuidanceAlertViewTitleEMIInterference" = "Frequent Reader Disconnections";

/* The title of the UI Alert view that is displayed when a reader connectivity issue regarding a flaky USB cable is detected. */
"HQReaderConnectivityGuidanceAlertViewTitleFlakyCable" = "Frequent Cable Disconnections";

/* The description indicating how to swipe more successfully for the error message. */
"LCRReaderCapabilitySwipeFailedErrorDescription" = "Swipe Quickly";

/* The message indicating that a swipe was unsuccessful. */
"LCRReaderCapabilitySwipeFailedErrorTitle" = "Please Retry";

/* Format string for concatenated printer make and model. */
"ManufacturerAndModelNameFormat" = "%1$@ %2$@";

/* Description used for an error when peripheral is reachable and some data was written to it, but communication was interrupted before all of the request data was sent. */
"PeripheralInterruptedErrorDescription" = "If the request didn't go through, give it another try.";

/* Title used for an error when peripheral is reachable and some data was written to it, but communication was interrupted before all of the request data was sent. */
"PeripheralInterruptedErrorTitle" = "Device Request Interrupted";

/* Description used for an error when a peripheral is not connected. */
"PeripheralNotConnectedErrorDescription" = "Please check your device's power and make sure everything is connected.";

/* Title used for an error when a peripheral is not connected. */
"PeripheralNotConnectedErrorTitle" = "Device Not Connected";

/* Description used for an error when a peripheral does not support a given operation. */
"PeripheralOperationUnsupportedErrorDescription" = "It looks like your device can't do that. Try a different device or a different operation.";

/* Title used for an error when a peripheral does not support a given operation. */
"PeripheralOperationUnsupportedErrorTitle" = "Operation Not Supported";

/* Description used for an error when all data for a request was successfully written to a peripheral, but checking the completion status of the request failed. */
"PeripheralRequestResultNotReceivedErrorDescription" = "If the request didn't go through, give it another try.";

/* Title used for an error when all data for a request was successfully written to a peripheral, but checking the completion status of the request failed. */
"PeripheralRequestResultNotReceivedErrorTitle" = "Potential Device Problem";

/* Description used for an error when a given function was supported and the peripheral was reachable, but the function failed to execute because the request size was too large for the peripheral to handle. */
"PeripheralRequestTooLargeErrorDescription" = "It looks like the print job was too big. Try breaking it into multiple requests.";

/* Title used for an error when a given function was supported and the peripheral was reachable, but the function failed to execute because the request size was too large for the peripheral to handle. */
"PeripheralRequestTooLargerErrorTitle" = "Device Request Too Large";

/* Description used for an error when an unknown problem occurred with a peripheral. */
"PeripheralUnknownErrorDescription" = "It looks like something went wrong. Please check the connection and device power.";

/* Title used for an error when an unknown problem occurred with a peripheral. */
"PeripheralUnknownErrorTitle" = "Device Error";

/* Description used for an error when a peripheral is considered connected, but never responded to a given request. */
"PeripheralUnreachableErrorDescription" = "Please check your device's power and make sure everything is connected.";

/* Title used for an error when a peripheral is considered connected, but never responded to a given request. */
"PeripheralUnreachableErrorTitle" = "Device Unreachable";

/* Description used for an error when there the printer's cover is open. */
"PrinterCoverOpenErrorDescription" = "Please close the printer's paper compartment.";

/* Title used for an error when there the printer's cover is open. */
"PrinterCoverOpenErrorTitle" = "Printer Cover Open";

/* Description used for an error when there is a problem with the printer's cutter. */
"PrinterCutterErrorDescription" = "Please check the printer's cutter.";

/* Title used for an error when there is a problem with the printer's cutter. */
"PrinterCutterErrorTitle" = "Printer Cutter Problem";

/* Description used for a warning when the paper in the printer is low. */
"PrinterLowPaperWarningDescription" = "You're going to need more paper soon.";

/* Title used for a warning when the paper in the printer is low. */
"PrinterLowPaperWarningTitle" = "Printer Paper Is Low";

/* Description used for an error when there is a mechanical problem with the printer. */
"PrinterMechanicalErrorDescription" = "Please check the printer for mechanical problems.";

/* Title used for an error when there is a mechanical problem with the printer. */
"PrinterMechanicalErrorTitle" = "Mechanical Problem";

/* Description used for an error when there the printer is out of paper. */
"PrinterOutOfPaperErrorDescription" = "The printer is out of paper. Please put in more paper.";

/* Title used for an error when there the printer is out of paper. */
"PrinterOutOfPaperErrorTitle" = "Printer Out of Paper";

/* Description used for an error when the paper in the printer is jammed. */
"PrinterPaperJamErrorDescription" = "Please clear the paper jam and reset the paper roll";

/* Title used for an error when the paper in the printer is jammed. */
"PrinterPaperJamErrorTitle" = "Printer Paper Jam";

/* Description used for an error when all data for a request was successfully written to a peripheral, but checking the completion status of the request failed. */
"PrinterRequestResultNotReceivedErrorDescription" = "Please check the printer's network connection. Visit Support Centre for more help.";

/* Title used for an error when all data for a request was successfully written to a peripheral, but checking the completion status of the request failed. */
"PrinterRequestResultNotReceivedErrorTitle" = "Printer Issue";

/* Description used for a warning when the paper in the printer is very low. */
"PrinterVeryLowPaperWarningDescription" = "You need to put in more paper.";

/* Title used for a warning when the paper in the printer is very low. */
"PrinterVeryLowPaperWarningTitle" = "Printer Paper Is Very Low";

/* The manufacturer name for bluetooth connected card readers made by Miura. */
"ReaderCapabilityManufacturerNameMiura" = "Miura";

/* The manufacturer name for headphone jack connected card readers made by Square. */
"ReaderCapabilityManufacturerNameSquare" = "Square";

/* The model name for the Miura Reader for Cards (codename A10) */
"ReaderCapabilityModelNameA10" = "Card Reader";

/* The model name for the Square Reader for chip (codename R6) */
"ReaderCapabilityModelNameR6" = "Chip";

/* The subtitle shown to the user when a reader drops to a low battery level while connected to Point of Sale. Ex. 'Reader for contactless and chip battery is at 20%.  Plug in the reader via USB to charge the battery.' */
"ReaderDetectedLowBatteryLevelAlertMessageFormatString-A10" = "Card Reader battery is at %1$@%.  Plug in the reader via USB to charge the battery.";

/* The subtitle shown to the user when an R12 drops to a low battery level while connected to Point of Sale. Ex. 'Square Reader for contactless and chip battery is at 20%.  Plug in the reader via USB to charge the battery.' */
"ReaderDetectedLowBatteryLevelAlertMessageFormatString-R12" = "Square Reader for contactless and chip battery is at %1$@%%.  Plug in the reader via USB to charge the battery.";

/* The subtitle shown to the user when a reader drops to a low battery level while connected to Point of Sale. Ex. 'Reader for contactless and chip battery is at 20%.  Plug in the reader via USB to charge the battery.' */
"ReaderDetectedLowBatteryLevelAlertMessageFormatString-R6" = "Chip Reader battery is at %1$@%.  Plug in the reader via USB to charge the battery.";

/* The name for Square Readers that read only magstripe cards (R4-class devices) */
"ReaderModelNameMagstripe" = "Magstripe";

/* Format string for placeholder WiFi printer name that includes placeholder number. */
"SQNetworkPrinterPlaceholderNameFormat" = "WiFi Printer %1$@";

/* Format string for placeholder USB printer name that includes placeholder number. */
"SQUSBPrinterPlaceholderNameFormat" = "USB Printer %1$@";

/* The default error title shown to the user when a secure session fails. */
"SecureSessionFailureErrorTitle-Default" = "Reader Failed to Connect";

/* The default error subtitle shown to the user when a secure session fails. */
"SecureSessionFailureNotificationDescription-Default" = "Please contact support.";

/* The error subtitle shown to the user when an attempt to establish secure session fails due to the max number of readers already being conected. */
"SecureSessionFailureNotificationDescription-MaxReadersConnected" = "The maximum number of readers have already been connected.";

/* The error subtitle shown to the user when a secure session fails due to a flaky/unreliable internet connection. */
"SecureSessionFailureNotificationDescription-NetworkTimeOut" = "There was a problem connecting to the internet. Confirm your internet connection is working and try again.";

/* The error subtitle shown to the user when a secure session establishment fails due to Square having server issues. */
"SecureSessionFailureNotificationDescription-ServerError" = "Please try again later or contact support if this message persists.";

/* The error subtitle shown to the user when an attempt to establish secure session fails. */
"SecureSessionFailureNotificationDescriptionDefault-TryAgain" = "Please press “Try Again” or contact support if this message persists.";

/* The error title shown to the user when a secure session fails due to a flaky/unreliable internet connection. */
"SecureSessionFailureNotificationTitle-NetworkTimeOut" = "Reader Requires Internet Connection";

/* Format string for Stand Bar code Scanner detail text. The argument is the port number. */
"StandBarcodeScannerDetailTextFormatString" = "Connected to Port %@";

/* Format string for Stand Bar code Scanner detail text when port number is unknown. */
"StandBarcodeScannerDetailTextNoUSBPortNumber" = "Connected via USB";

/* Format string for Stand Cash Drawer detail text. The argument is the port number. */
"StandCashDrawerDetailTextFormatString" = "Connected to Port %@";

/* Format string for Stand Cash Drawer detail text when port number is unknown. */
"StandCashDrawerDetailTextNoUSBPortNumber" = "Connected via USB";

/* If a stand has no name and no product name, this is used as the stand's display name. */
"StandDefaultName" = "Square Stand";

/* If a WiFi printer has no name and no product name, this is used as the printer's display name. */
"StarNetworkPrinterDefaultName" = "WiFi Printer";

/* If a USB printer has no name and no product name, this is used as the printer's display name. */
"USBPrinterDefaultName" = "USB Printer";

